/*
type:
single-option multiple-option indenifite-option
*/
/*

*/
window.problems = {
    bank: {
        1: {
            type: "single-option",
            stem: "逃走中第一回的播出日期是？",
            option: ["A. 2004年10月1日", "B. 2004年9月24日", "C. 2004年10月2日", "D. 2004年6月26日"]
        },
        2: {
            type: "single-option",
            stem: "史上首个逃走成功的（以第1回为标准）逃走者是谁？",
            option: ["A. つるの剛士（鹤野刚士）", "B. ウエンツ瑛士（Wentz瑛士）",
                "C. 保阪尚希（保坂尚辉）", "D. ゴルゴ松本（Golgo松本）]"]
        },
        3: {
            type: "single-option",
            stem: "2007年开始放送的「クロノス（Chronos）」系列中最先播出的是哪个游戏？",
            option: ["A. 解除中", "B. 密告中", "C. 护卫中", "D. 战斗中"]
        }, 4: {
            type: "single-option",
            stem: "最早出现的不需要遵守交通规则的逃走区域是？",
            option: ["A. 栃木·日光江户村", "B. 藤原历史公园",
                "C. 长崎·豪斯敦堡", "D. 千叶·房总之村"]
        }, 5: {
            type: "single-option",
            stem: "被称为「Mr.逃走中」的逃走者是下列哪位？"
            , option: ["A. 濱口優（滨口优）", "B. HIKAKIN", "C. 狩野英孝", "D. 田中卓志"]
        }, 6: {
            type: "single-option",
            stem: "下列哪个区域只被使用一次？"
            , option: ["A. 东京·读卖乐园", "B. 冲绳·滨比嘉岛",
                "C. 横滨·横滨中华街", "D. 上野"]
        }, 7: {
            type: "single-option",
            stem: "被称为「1号机」的猎人是在哪一回退役的？"
            , option: ["A. 第三十二回 アルティメット2週目（终极篇第二轮）",
                "B. 第三十四回 最後のサムライ（最后的武士）",
                "C. 第三十六回 ハンター消滅（消灭猎人）",
                "D. 第三十九回 時空を超える決戦(後編)（超时空对战后半战）"]
        }, 8: {
            type: "single-option",
            stem: "最先开发出猎人的角色是？"
            , option: ["A. 月村サトシ（月村悟）", "B. 高月ハンゾウ（高月半藏）",
                "C. 青山シズカ（青山静）", "D. 如月カケル（如月翔）"]
        }, 9: {
            type: "single-option",
            stem: "最先出现区域内剧情的是？"
            , option: ["A. 第十一回 上野",
                "B. 第十三回 江戸（江户）",
                "C. 第十四回 王国の走り人（王国中的逃走者）",
                "D. 第十七回 呪われた遊園地（被诅咒的游乐园）"]
        }, 10: {
            type: "single-option",
            stem: "自节目播出以来最高的可能奖金（无论有没有获得）是多少？"
            , option: ["A. 252万", "B. 276万", "C. 504万", "D. 284万"]
        }, 11: {
            type: "single-option",
            stem: "下列哪个区域使用次数最多？"
            , option: ["A. 东京·台场", "B. 千叶·房总之村", "C. 栃木·日光江戸村", "D. 冲绳·区域01"]
        }, 12: {
            type: "single-option",
            stem: "哪名猎人到现在还是现役？"
            , option: ["A. 01KR", "B. 02NN", "C. 06TT", "D. 08TG"]
        }, 13: {
            type: "single-option",
            stem: "下列哪一位逃走者没有自首经验？"
            , option: ["A. 鈴木拓（铃木拓）", "B. 久保田和靖", "C. 水田信二", "D. 岡野陽一（冈野阳一）"]
        }, 14: {
            type: "single-option",
            stem: "下列哪位逃走者不是在台场逃走成功的？"
            , option: ["A. 矢口真里（矢口真里）", "B. おのののか（小野乃乃香）",
                "C. 矢吹奈子", "D. 伊沢拓司（伊泽拓司）"]
        }, 15: {
            type: "single-option",
            stem: "哪一期第一次出现「オープニングゲーム（开场游戏）」？"
            , option: ["A. 第五回 渋谷3（涩谷3）", "B. 第七回 お台場2（台场2）",
                "C. 第八回 浅草（浅草）", "D. 第十回 池袋"]
        }
        , 16: {
            type: "single-option",
            stem: "在「第三十四回 最後のサムライ（最后的武士）」中，有一个倒霉蛋被背后杀了两次，他是谁？"
            , option: ["A. 児嶋一哉（儿岛一哉）", "B. ケンドーコバヤシ（剑道小林）",
                "C. 山崎邦正", "D. 戸次重幸（户次重幸）"]
        }
        , 17: {
            type: "single-option",
            stem: "在「第十三回 江戸（江户）」的开场游戏中，放出猎人的是叶美香，那么被抓的是？"
            , option: ["A. 山田親太朗（山田亲太朗）", "B. 忍成修吾",
                "C. 道重さゆみ（道重沙由美）", "D. 叶美香"]
        }
        , 18: {
            type: "single-option",
            stem: "下列区域中哪个区域从未有人逃走成功？"
            , option: ["A. 横滨·横滨中华街", "B. 佐贺·吉野里历史公园",
                "C. 东京·富士急乐园", "D. 池袋"]
        }
        , 19: {
            type: "single-option",
            stem: "截止「第六十三回 逃走中 お台場リベンジャーズ（台场复仇者）」，拿到最高额奖金的逃走者是谁？"
            , option: ["A. シバター（shibatar，西巴塔）", "B. 伊沢拓司（伊沢拓司）",
                "C. 上地雄輔（上地雄辅）", "D. ゴリ（猩爷）"]
        }
        , 20: {
            type: "single-option",
            stem: "「生逃走中」是两次大晦日SP的衍生番外，下面关于「生逃走中」的说法中，有误的是？"
            , option: ["A. 最大的特点是其节目形式，是直播而非录播。",
                "B. 猎人背后总是背着一个装置，其作用是为猎人头上的摄像装备充电。",
                "C. 游戏过程中同样会有任务。",
                "D. 最终分发的总奖金随着逃走成功的人数的增加而增加。"]
        }
        , 21: {
            type: "single-option",
            stem: "节目正片（排除试验回）中第一个被抓到的是？"
            , option: ["A. 遠藤久美子（远藤久美子）",
                "B. 定岡正二（定冈正二）",
                "C. ニコラス・ペタス（尼可拉斯佩塔斯）",
                "D. 府川亮"]
        }
        , 22: {
            type: "single-option",
            stem: "这里举办的逃走中尚未有全灭。请问这个区域是？"
            , option: ["A. 横滨·八景岛海洋乐园", "B. 千叶·房总之村",
                "C. 藤原历史公园", "D. 东京·台场"]
        }
        , 23: {
            type: "single-option",
            stem: "哪一位逃走者有第一个被抓的黑历史？"
            , option: ["A. 田中卓志", "B. 矢吹奈子",
                "C. HIKAKIN", "D. 濱口優（滨口优）"]
        }
        , 24: {
            type: "single-option",
            stem: "哪一期的最多可能放出猎人数量是最高的？"
            , option: ["A. 第七回 お台場2（台场2）",
                "B. Netflix联动篇 Battle Royal（皇家之战）",
                "C. 第五十九回 お台場大決戦（台场决战）",
                "D. 第四十一回 めちゃ×2本気で逃ゲてるッ（认真逃走）（mechaike联动）"]
        }
        , 25: {
            type: "single-option",
            stem: "下列哪一期的游戏时间不是130分钟？"
            , option: ["A. 第三十七回 白雪姫と七人の侍（白雪姬和七武士）",
                "B. 第六十二回 ハンターと強欲の王（猎人与强欲之王）",
                "C. 第四十一回 めちゃ×2本気で逃ゲてるッ（认真逃走）",
                "D. 第五十三回 まる子大捜索指令（小丸子大搜索指令）（樱桃小丸子联动）"]
        }
        , 26: {
            type: "single-option",
            stem: "哪名逃走成功者在逃走成功前面对大量猎人（以超过15体为标准）逃走了更长时间？"
            , option: ["A. 兼近大樹（兼近大树）", "B. 朝日奈央",
                "C. 古橋法生（古桥法生）", "D. 小塚崇彦"]
        }
        , 27: {
            type: "single-option",
            stem: "月村サトシ（月村悟）身边的哪一位跟班其实是间谍？"
            , option: ["A. 青山シズカ（青山静）", "B. 朱月サク（朱月策）",
                "C. 高月ハンゾウ（高月半藏）", "D. 水無月ユリエ（水无月怜）"]
        }
        , 28: {
            type: "single-option",
            stem: "「第三十五回 奥様はかぐや姫（辉夜姬夫人）」的首发四名猎人分别是08、07、18和？"
            , option: ["A. 02NN", "B. 19TY", "C. 20HT", "D. 29AM"]
        }
        , 29: {
            type: "single-option",
            stem: "逃走成功者中，逃走时间最长的一位是谁？"
            , option: ["A.槙野智章", "B.佐藤大樹（佐藤大树）",
                "C.兼近大樹（兼近大树）", "D.伊沢拓司（伊沢拓司）"]
        }
        , 30: {
            type: "single-option",
            stem: "下列的老手有且只有一人尚未活到最后三人，请问他是？"
            , option: ["A.澤部佑（泽部佑）", "B.吉村崇",
                "C.狩野英孝", "D.春日俊彰（春日俊彰）"]
        }
        , 31: {
            type: "single-option",
            stem: "下列的偶像组合中，派出人数累计最多的团是？"
            , option: ["A.JO1", "B.INI", "C.日向坂46", "D.乃木坂46"]
        }
        , 32: {
            type: "single-option",
            stem: "第15回中，下列四人中只有一个人不去做指纹认证任务，请问是谁？"
            , option: ["A.ダンテ・カーヴァー（丹特卡佛）", "B.箕輪はるか（箕轮遥）",
                "C.小倉優子（小仓优子）", "D.井筒和幸"]
        }
        , 33: {
            type: "single-option",
            stem: "节目中不少逃走者共同出现过，下列哪对共演的次数更多？"
            , option: ["A.クロちゃん（小黑） & 矢吹奈子",
                "B.中田敦彦 & 徳井義実（徳井义实）",
                "C.藤森慎吾（藤森慎吾） & 眞鍋かをり（真锅香织）",
                "D.HIKAKIN & 田中卓志"]
        }
        , 34: {
            type: "single-option",
            stem: "下列哪一位日向坂成员（含前成员）没有上过逃走中？"
            , option: ["A.渡邉美穂（渡边美穗）", "B.河田陽菜（河田阳菜）",
                "C.影山優佳（影山优佳）", "D.丹生明里"]
        }
        , 35: {
            type: "single-option",
            stem: "哪一回的天气不是阴天？"
            , option: ["A.第五十八回 上陸！猛獣の島（登陆猛兽之岛）",
                "B.第十八回 信長と忍者の里（信长与忍者之里）",
                "C.第十回 池袋",
                "D.第四十九回 ONE TEAM VS 新型ハンター（对战新型猎人）"]
        }

        , 36: {
            type: "multiple-option",
            stem: "（2分）下列哪一位不是因为岛民的影响而被抓的？"
            , option: ["A.おいでやす小田（欢迎光临小田）", "B.小林由依",
                "C.タケヤキ翔（Takeyaki翔）", "D.大原優乃（大原优乃）"]
        }
        , 37: {
            type: "multiple-option",
            stem: "（2分）战斗中是逃走中的同系列作品，因其播出档期相近，总是会有相同的嘉宾出现。下面逃走者中在战斗中里胜出的有？"
            , option: ["A.DAIGO", "B.佐野岳", "C.菜々緒（菜菜绪）", "D.高橋みゆき（高桥美雪）"]
        }
        , 38: {
            type: "multiple-option",
            stem: "（2分）为了增加节目的趣味性，节目组总是投放有趣的任务装置以及追加的要素。下面哪些要素在在「第五十回 真夏のハンターランド（盛夏的猎人大陆）」中出现过？"
            , option: ["A.拉杆", "B.直升机", "C.无人机", "D.小孩猎人"]
        }
        , 39: {
            type: "multiple-option",
            stem: "（2分）第一位逃走成功的ジャニーズ事務所（杰尼斯事务所）艺人是？"
            , option: ["A.高橋海人（高桥海人）", "B.佐藤胜利",
                "C.目黒莲（目黑莲）", "D.岩本照"]
        }
        , 40: {
            type: "multiple-option",
            stem: "（2分）哪期的奖金提升任务没有失败但也没有提到最高？"
            , option: ["A.第五十五回 ルフィと黄金の秘宝（路飞和黄金秘宝）",
                "B.第五十二回 ハンター迎撃作戦（猎人迎击作战）",
                "C.第五十七回 ハンターと偽ハンター（猎人和假猎人）",
                "D.第五十一回 ハンターと鋼鉄の魔神（钢铁魔神）"]
        }
        , 41: {
            type: "multiple-option",
            stem: "通报类任务是常见的任务形式之一，往往会伴随着警报鸣响的残酷惩罚。下面哪几回中的通报任务会导致警报鸣响？"
            , option: ["A.第五十二回 ハンター迎撃作戦（猎人迎击作战）",
                "B.第四十六回 横浜中華街大決戦！（横滨中华街决战）（超龙珠联动）",
                "C.第十九回 激動明治の大事変（明治事变）",
                "D.第五十九回 大みそかSP お台場大決戦（台场大决战）"]
        }
        , 42: {
            type: "multiple-option",
            stem: "「体内時計計測ゲーム（读秒）」是一个常出现的开场游戏，下面哪些 / 哪个逃走者尝试用歌曲计时的方式过关？",
            option: ["A.ピエール瀧（皮埃尔泷）", "B.梅田彩佳", "C.千秋", "D.Ami"]
        }
        , 43: {
            type: "multiple-option",
            stem: "「第五十二回 ハンター迎撃作戦（猎人迎击作战）」是极为少见的少数猎人全数放出的情况。放出猎人的编号分别是？"
            , option: ["A. 47", "B. 51", "C. 44", "D. 32"]
        }
        , 44: {
            type: "multiple-option",
            stem: "下列哪个逃走者是在没预料到自己会被抓的情况下直接被抓到的？"
            , option: ["A.中島颯太（中岛飒太）", "B.平子祐希",
                "C.えなこ（Enako）", "D.原口あきまさ（原口晶匡）"]
        }
        , 45: {
            type: "multiple-option",
            stem: "在开场游戏「鎖引き（猎人之链）」中，总是有倒霉蛋抽中放出猎人的链条。请问哪些颜色曾作为放出猎人的链条的颜色？"
            , option: ["A.卡其色", "B.斑马色", "C.老虎色", "D.水蓝色"]
        }
        , 46: {
            type: "multiple-option",
            stem: "纬来电视台曾购买了从第1回到第39回为止绝大多数的版权，制作了画质较糊的版本。请问下列哪几期没有被纬来台买过版权："
            , option: ["A.第三回 江戸の町（江户城镇）",
                "B.第四回 お台場（台场）",
                "C.第六回 ハウステンボス（豪斯顿堡）",
                "D.第三十七回 白雪姫と七人の侍（白雪姬和七武士）"]
        }, 47: {
            type: "multiple-option",
            stem: "在「第五十七回 ハンターと偽ハンター（猎人和假猎人）」中，假猎人的出现干扰了部分逃走者的视线，加大了游戏难度。下面的逃走者中，不是因为假猎人干扰视线而被真猎人抓住的逃走者是？"
            , option: ["A.本田仁美", "B.五関晃一（五关晃一）"
                , "C.井上裕介", "D.丹生明里"]
        }
    },
    structure: [
        { stem: "一、单选题（每题有且仅有一个最符合题意的选项，2分一题，共70分）", breif: "单选题", title: new Array() },
        { stem: "二、不定项选择题（每题均有一个或多个正确选项，错选、不选、多选不得分，漏选得1分，全对得满分，除标注外，每小题满分3分，总分30分）", breif: "多选题", title: new Array() }
    ]
}

const dictionary = new Array();

function generateDictionary() {
    for (var i = ('A').charCodeAt(); i <= ('Z').charCodeAt(); i++) {
        dictionary.push(String.fromCharCode(i));
    }
    for (var i = ('a').charCodeAt(); i <= ('z').charCodeAt(); i++) {
        dictionary.push(String.fromCharCode(i));
    }
    for (var i = 0; i <= 9; i++) {
        dictionary.push(String(i));
    }
    dictionary.push('+');
    dictionary.push('/');
}

$(document).ready(() => {
    generateDictionary();
    for(var i = 1; i <= 30; i++) problems.structure[0].title.push(i);
    for(var i = 31; i <= 45; i++) problems.structure[1].title.push(i);
});